Repository: danielesbe9526/FigthToMania
Catalog: FightomaniaApp/*.lproj/Localizable.strings
Languages: es_419

source: Welcome
es_419: Bienvenido

source: Enter confirmation code
es_419: Ingresa el código de confirmación

source: Enter the code we send to your email
es_419: Escribe el código que enviamos a tu correo

source: Code
es_419: Código

source: Resend
es_419: Reenviar

source: Terms and condition's
es_419: Terminos y condiciones

source: Want to become a new fighter?
es_419: ¿Quieres ser un nuevo luchador?

source: Sign up here
es_419: Regístrate aquí

source: Fighter Name
es_419: Nombre de luchador

source: Password
es_419: Contraseña

source: Stay signed in
es_419: Mantenerme conectado

source: Log in
es_419: Inicia Sesión

source: I don't remember my password
es_419: No recuerdo mi contraseña

source: What is your name?
es_419: ¿Cómo te llamas?

source: First Name
es_419: Nombres

source: Last Name
es_419: Apellidos

source: By tapping Sign up & Accept, you are agree with our Terms of Service and Privacy Policy
es_419: Al pulsar Aceptar y Registrarme, estás de acuerdo con nuestros Términos del servicio y nuestra Politica de privacidad

source: Sign Up & Accept
es_419: Aceptar y Registrarme

source: When is you birthday?
es_419: ¿Cuál es tu fecha de nacimiento?

source: Continue
es_419: Continuar

source: Pick a fighter name
es_419: Elige un nombre de luchador

source: Set a password
es_419: Crea tu contraseña

source: Your password must be at least 8 characters long, include a capital letter, a number and a symbol
es_419: Tu contraseña debe contener al menos 8 carácteres, incluyendo una mayúscula, un número y un símbolo

source: Hide
es_419: Ocultar

source: Show
es_419: Mostrar

source: What is your email address?
es_419: ¿Cuál es tu dirección de correo electrónico?

source: We will send you a confirmation link for complete the registration
es_419: Enviaremos un enlace de confirmación para completar tu registro

source: Email
es_419: Correo electrónico

source: Registry Confirmation
es_419: Confirma tu registro

source: Please verify your email for confirmate your register
es_419: Por favor verifica tu correo electronico para confirmar tu registro

source: OK
es_419: Vale

source: Perfect! you are a fighter in Fightomania
es_419: ¡Perfecto! Ya eres un luchador en Fightomania

source: Now pick up a Battle Cry for provoke your opponents
es_419: Ahora elige un grito de batalla para provocar a tus rivales

source: Need inspiration? You can complete later in profile section
es_419: ¿Necesitas inspiración? Puedes completar este paso en tu sección de perfil

source: Fight Now
es_419: Lucha ahora

source: Reset Password
es_419: Recupera tu contraseña

source: Confirm your email to send you a reset password link
es_419: Confirma tu correo para enviarte un enlace de recuperación de contraseña

source: Send Link
es_419: Envíar Enlace
